app/controllers/moods_controller.rb

SELECT "moods".* FROM "moods"
---
  def index
    @moods = Mood.all

SELECT "moods".* FROM "moods" WHERE "moods"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_mood
      @mood = Mood.find(params[:id])