app/controllers/remedies_controller.rb

SELECT "remedies".* FROM "remedies"
---
  def index
    @remedies = Remedy.all

SELECT "remedies".* FROM "remedies" WHERE "remedies"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
    def set_remedy
      @remedy = Remedy.find(params[:id])